src/cf/InformationRegisters/ЗадачиБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиБухгалтера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРегулярныхПлатежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроверкиКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
						<v8:Type>cfg:EnumRef.ЗадачиНачалаРаботы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаПредставленияОтчетовУплатыНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АктуальностьСпискаЗадачБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьСпискаЗадачБухгалтера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДействийКалендаряБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДействийКалендаряБухгалтера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЗадачиНачалаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЗадачиНачалаРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписокНалоговОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаЗаполненияФормСтатистики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение1СОтчетности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение1СЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДоступКОрганизациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьРеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьБыстрыйСтарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВидеоурок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПараметрыУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУчетнаяПолитика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНачальныеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНастройкаТорговыхТочек</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ОтносительныеСроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ОтносительныеСроки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сегодня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завтра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НесколькоДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвеНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТриНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПравилаПредставленияОтчетовУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПравилаПредставленияОтчетовУплатыНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиБухгалтера</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКалендаряБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтставаниеБазовогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИнформацияНаИТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
					<Comment>объединяются по "И"</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УсловияПримененияТребованийЗаконодательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПравилаРегулярныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПравилаРегулярныхПлатежей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполняется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КалендарьБухгалтера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПредставлениеПериодаСобытия(НачалоПериода, КонецПериода) Экспорт
	
	Возврат НРег(ПредставлениеПериода(НачалоПериода, КонецПериода, "ФП=Истина"));
	
КонецФункции

// Возвращает массив периодов в интервале. 
// Возвращаются все периоды, пересекающиеся с интервалом.
// Возвращаются даты начала периода.
Функция Периоды(НачалоИнтервала, КонецИнтервала, Период) Экспорт
	
	Периоды = Новый Массив;
	
	ТекущийПериод = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Период, КонецИнтервала);
	Периоды.Добавить(ТекущийПериод);
	
	Пока ТекущийПериод > НачалоИнтервала Цикл
	
		ТекущийПериод = ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(ТекущийПериод, Период, -1);
		Периоды.Вставить(0, ТекущийПериод); // Пятимся назад, а значения в массиве хотим по возрастанию.
	
	КонецЦикла;
	
	Возврат Периоды;
	
КонецФункции

Функция ДатаНачалаДеятельности(Организация) Экспорт
	
	// Интервал начинается не ранее даты выдачи свидетельства о регистрации ИП,
	// или даты регистрации для юридического лица
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|			ТОГДА Организации.СвидетельствоДатаВыдачи
	|		ИНАЧЕ Организации.ДатаРегистрации
	|	КОНЕЦ КАК Дата
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	НачалоИнтервала = '0001-01-01';
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачалоИнтервала = Макс(НачалоИнтервала, Выборка.Дата);
	КонецЦикла;
	
	Возврат НачалоИнтервала;
	
КонецФункции

Функция НачалоАктуальногоПериода(Правило, ТекущаяДата, ДатаНачалаДеятельности = '0001-01-01') Экспорт
	
	// В качестве параметра Правило можно передавать ссылку на правило 
	// или иной объект (выборку, структуру) со свойствами 
	// Периодичность, СрокМесяцев, СрокДней, Действие, БазовыйПериод, ОтставаниеБазовогоПериода
	
	День = 24 * 60 * 60;
	
	СобытиеПозжеРелевантногоПериода = СрокИстекаетПослеОкончанияРелевантногоПериода(Правило);
	
	// Запас позволяет игнорировать правила переноса дат на выходные
	АктуальныйПериод = ТекущаяДата - 15 * День;
	
	Если СобытиеПозжеРелевантногоПериода Тогда
		
		// ограничимся периодом, по которому заведомо успеваем
		АктуальныйПериод = ДобавитьМесяц(АктуальныйПериод - Правило.СрокДней * День, - Правило.СрокМесяцев);
		
		АктуальныйПериод = Макс(АктуальныйПериод, ДатаНачалаДеятельности);
		
	Иначе
		
		// Базовый период предшествует релевантному и может быть другой длительности.
		ПростойБазовыйПериод = БазовыйПериодОпределяетсяПросто(Правило);
		ДлительностьБазовогоПериода = Правило.Периодичность;
		Если Не ПростойБазовыйПериод Тогда
			ДлительностьБазовогоПериода = Правило.БазовыйПериод;
		КонецЕсли;
		
		// Базовый период всегда предшествует сроку
		ОтставаниеБазовогоПериода = Правило.ОтставаниеБазовогоПериода;
		УточнитьОтставаниеБазовогоПериода(
			ОтставаниеБазовогоПериода, 
			ДлительностьБазовогоПериода, 
			Правило.СрокМесяцев);
		
		ОпережениеБазовогоПериода = 1 + ОтставаниеБазовогоПериода;
		
		АктуальныйПериод = ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(
			АктуальныйПериод,
			Правило.БазовыйПериод,
			- ОпережениеБазовогоПериода);
		
	КонецЕсли;
	
	
	Возврат АктуальныйПериод;
	
КонецФункции

Функция СрокИстекаетПослеОкончанияРелевантногоПериода(Правило) Экспорт
	
	// В качестве параметра можно передавать ссылку на правило 
	// или иной объект (выборку, структуру) со свойствами 
	// СрокМесяцев, СрокДней
	Возврат Не (Правило.СрокМесяцев < 0 Или Правило.СрокМесяцев = 0 И Правило.СрокДней = 0);
	
КонецФункции

Функция БазовыйПериодОпределяетсяПросто(Правило) Экспорт
	
	// В качестве параметра можно передавать ссылку на правило 
	// или иной объект (выборку, структуру) со свойствами 
	// Действие, БазовыйПериод, Периодичность, ОтставаниеБазовогоПериода
	
	Возврат Правило.Действие <> Перечисления.ВидыДействийКалендаряБухгалтера.УплатаНалога
		Или Не ЗначениеЗаполнено(Правило.БазовыйПериод)
		Или (Правило.БазовыйПериод = Правило.Периодичность И Правило.ОтставаниеБазовогоПериода = 0);
		
КонецФункции 

Функция ЗапуститьЗаполнениеВФоне(УникальныйИдентификаторФормы, Организация, СозданаНоваяОрганизация = Ложь, ОбновитьИЗаполнитьЗадачиНачалаРаботы = Истина, ОбновитьИЗаполнитьРегулярныеЗадачи = Истина) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("Организация", Организация);
	ПараметрыПроцедуры.Вставить("Упреждение", УпреждениеЗаполненияСписка());
	ПараметрыПроцедуры.Вставить("СозданаНоваяОрганизация", СозданаНоваяОрганизация);
	ПараметрыПроцедуры.Вставить("ОбновитьИЗаполнитьЗадачиНачалаРаботы", ОбновитьИЗаполнитьЗадачиНачалаРаботы);
	ПараметрыПроцедуры.Вставить("ОбновитьИЗаполнитьРегулярныеЗадачи",   ОбновитьИЗаполнитьРегулярныеЗадачи);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторФормы);
	ПараметрыВыполненияВФоне.Вставить("ОжидатьЗавершение", 0); // Возвращать управление сразу
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания",
		НСтр("ru = 'Обновление списка задач бухгалтера'"));
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"КалендарьБухгалтера.ЗаполнитьВФоне",
		ПараметрыПроцедуры,
		ПараметрыВыполненияВФоне);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВФоне(Параметры, ВременноеХранилищеРезультата) Экспорт
	Перем Организация, Упреждение, СозданаНоваяОрганизация;
	Перем ОбновитьИЗаполнитьЗадачиНачалаРаботы, ОбновитьИЗаполнитьРегулярныеЗадачи;
	
	Если Параметры <> Неопределено Тогда
		
		Параметры.Свойство("Организация", Организация);
		Параметры.Свойство("Упреждение", Упреждение);
		Параметры.Свойство("СозданаНоваяОрганизация", СозданаНоваяОрганизация);
		
		Параметры.Свойство("ОбновитьИЗаполнитьЗадачиНачалаРаботы", ОбновитьИЗаполнитьЗадачиНачалаРаботы);
		Параметры.Свойство("ОбновитьИЗаполнитьРегулярныеЗадачи",   ОбновитьИЗаполнитьРегулярныеЗадачи);
		
	КонецЕсли;
	
	Если Упреждение = Неопределено Тогда
		Упреждение = УпреждениеЗаполненияСписка();
	КонецЕсли;
	
	Если СозданаНоваяОрганизация = Неопределено Тогда
		СозданаНоваяОрганизация = Ложь;
	КонецЕсли;
	
	Если ОбновитьИЗаполнитьЗадачиНачалаРаботы = Неопределено Или ОбновитьИЗаполнитьЗадачиНачалаРаботы Тогда
		ИзмененыЗадачиНачалаРаботы = РегистрыСведений.ЗадачиБухгалтера.ОбновитьИЗаполнитьЗадачиНачалаРаботы(Организация, СозданаНоваяОрганизация);
	Иначе
		ИзмененыЗадачиНачалаРаботы = Ложь;
	КонецЕсли;
	
	Если ОбновитьИЗаполнитьРегулярныеЗадачи = Неопределено Или ОбновитьИЗаполнитьРегулярныеЗадачи Тогда
		ИзмененыРегулярныеЗадачи = РегистрыСведений.ЗадачиБухгалтера.ОбновитьИЗаполнитьРегулярныеЗадачи(Организация, Упреждение);
		МобильноеПриложениеПредприниматель.ОтправитьУведомленияОЗадачах();
		Если ИзмененыРегулярныеЗадачи Тогда
			СинхронизацияСКалендаремGoogle.СинхронизироватьЗадачи(Организация);
		КонецЕсли;
	Иначе
		ИзмененыРегулярныеЗадачи = Ложь;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ИзмененыЗадачиНачалаРаботы Или ИзмененыРегулярныеЗадачи, ВременноеХранилищеРезультата);
	
КонецПроцедуры

Процедура ЗаполнитьРегламентнымЗаданием() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	РегистрыСведений.ЗадачиБухгалтера.ОбновитьИЗаполнитьЗадачиНачалаРаботы();
	
	ИзмененыРегулярныеЗадачи = РегистрыСведений.ЗадачиБухгалтера.ОбновитьИЗаполнитьРегулярныеЗадачи(
		, УпреждениеЗаполненияСписка());
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Справочники.ПроверкиКонтролирующимиОрганами.СоздатьЗадачиБухгалтераПоНовымПроверкам();
	КонецЕсли;
	
	МобильноеПриложениеПредприниматель.ОтправитьУведомленияОЗадачах();
	
	СинхронизацияСКалендаремGoogle.СинхронизироватьЗадачи();
	
КонецПроцедуры

Функция НовоеРасписаниеРегламентногоЗадания()
	
	ЭталонноеРасписание = Новый РасписаниеРегламентногоЗадания;
	
	// стандартный вариант заполнения
	ЭталонноеРасписание.ПериодНедель = 1;
	ЭталонноеРасписание.ПериодПовтораДней = 1;
	
	НаборПериодов = Новый Массив;
	Для Инд = 1 По 7 Цикл
		НаборПериодов.Добавить(Инд);
	КонецЦикла;
	ЭталонноеРасписание.ДниНедели = НаборПериодов;
	
	НаборПериодов = Новый Массив;
	Для Инд = 1 По 12 Цикл
		НаборПериодов.Добавить(Инд);
	КонецЦикла;
	ЭталонноеРасписание.Месяцы = НаборПериодов;
	
	Возврат ЭталонноеРасписание;
	
КонецФункции

// Для регламентного задания ОбновлениеЗадачБухгалтера устанавливает расписание в зависимости от типа СУБД (файловая/серверная).
//
Процедура ИзменитьРасписаниеСогласноРежимуРаботы() Экспорт
	
	ЭталонноеРасписаниеЗадания = ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(НовоеРасписаниеРегламентногоЗадания());
	ЭталонноеРасписаниеЗадания.ВремяНачала = ВремяНачалаОбновленияЗадачБухгалтера();
	
	РегламентныеЗаданияЗадачБухгалтера = РегламентныеЗаданияСервер.НайтиЗадания(
		Новый Структура("Метаданные", "ОбновлениеЗадачБухгалтера"));
	Для каждого РегламентноеЗадание Из РегламентныеЗаданияЗадачБухгалтера Цикл
		
		СуществующееРасписание = ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(РегламентноеЗадание.Расписание);
		Если ОбщегоНазначения.ДанныеСовпадают(СуществующееРасписание, ЭталонноеРасписаниеЗадания) Тогда
			Продолжить;
		КонецЕсли;
		
		РегламентныеЗаданияСервер.УстановитьРасписаниеРегламентногоЗадания(РегламентноеЗадание, ЭталонноеРасписаниеЗадания);
		
	КонецЦикла;
	
КонецПроцедуры

Функция УпреждениеЗаполненияСписка() Экспорт
	
	Возврат 14;
	
КонецФункции

Функция ВремяНачалаОбновленияЗадачБухгалтера()
	
	// Предполагается три варианта расписания выполнения регламентного задания ОбновлениеЗадачБухгалтера в зависимости от СУБД:
	// 1) Файловая база. Задание запускается в период предполагаемой низкой активности пользователя - после обеда.
	// 2) Серверная база. Задание запускается ночью после технологических заданий СУБД и ИБ (индексы, агрегаты, поиск).
	// 3) Сервис. Планирование задания выполняется на ближайшую ночь в момент использования функциональности.
	//    Алгоритм планирования - см. КалендарьБухгалтера.ЗапланироватьОбновлениеЗадачБухгалтера()
	
	Возврат ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(), Дата(1, 1, 1, 14, 22, 0), Дата(1, 1, 1, 2, 22, 0));
	
КонецФункции

Процедура УточнитьОтставаниеБазовогоПериода(ОтставаниеБазовогоПериода, ДлительностьБазовогоПериода, СрокМесяцев) Экспорт
	Если СрокМесяцев < -1 И ДлительностьБазовогоПериода = Перечисления.Периодичность.Месяц Тогда
		ОтставаниеБазовогоПериода = Макс(ОтставаниеБазовогоПериода, - 1 - СрокМесяцев);
	КонецЕсли;
КонецПроцедуры

// Возвращает возможность выполнения задачи текущим пользователем
//
Функция ПравоВыполненияЗадачи(Задача) Экспорт
	
	ЕстьПраво = Ложь;
	
	Если ТипЗнч(Задача) = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
		
		Если Задача = Перечисления.ЗадачиНачалаРаботы.СписокНалоговОтчетов Тогда
			
			ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НалогиОтчеты);
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики Тогда
			
			ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкаЗаполненияФормСтатистики);
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.Подключение1СОтчетности Тогда
			
			ЕстьПраво = ПравоДоступа("Использование", Метаданные.Обработки.ОбщиеОбъектыРеглОтчетности);
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.Подключение1СЭДО Тогда
			
			ЕстьПраво = ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЕстьПравоНастройкиЭДО(Ложь);
			Если Не ЕстьПраво Тогда
				
				ТекстСообщения = НСтр("ru = 'Недостаточно прав для настройки обмена электронными документами. Обратитесь к администратору.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Задача) = Тип("СправочникСсылка.ПравилаРегулярныхПлатежей") Тогда
		
		ЕстьПраво = ПравоДоступа("Изменение", Метаданные.Документы.ПлатежноеПоручение);
		
	Иначе
		
		ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЗадачиБухгалтера);
		
	КонецЕсли;
		
	Возврат ЕстьПраво;
	
КонецФункции

Процедура ОбновитьПроверкиКонтролирующимиОрганами() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	Справочники.ПроверкиКонтролирующимиОрганами.ОбновитьПроверки();

КонецПроцедуры

Процедура ОбновитьПроверкиКонтролирующимиОрганамиПоТаблицеОрганизаций(ТаблицаОрганизаций) Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	Справочники.ПроверкиКонтролирующимиОрганами.ОбновитьПроверкиПоТаблицеОрганизаций(ТаблицаОрганизаций);
	
	УстановитьПривилегированныйРежим(Истина);
	ОтборЗаданий = Новый Структура("Метаданные", 
		Метаданные.РегламентныеЗадания.ОбновлениеПроверокКонтролирующимиОрганамиПоТаблицеОрганизаций);
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(ОтборЗаданий);
	Для каждого Задание Из Задания Цикл
		Задание.Удалить();
	КонецЦикла;

КонецПроцедуры

// Выполняет обновление задач по указанной организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, для которой проверяется актуальность задач.
//	БыстроеОбновление - Булево - Признак необходимости проверки актуальности задач перед обновлением.
//		Если Истина, то в случае, когда задачи актуальны, обновление не запускается.
//
Процедура ОбновитьЗадачи(Организация, БыстроеОбновление = Истина) Экспорт
	
	ЗапланироватьОбновлениеЗадачБухгалтера();
	
	УпреждениеЗаполнения = КалендарьБухгалтера.УпреждениеЗаполненияСписка();
	
	Если БыстроеОбновление Тогда
		
		// Обеспечим, с одной стороны, наличие задач на несколько дней вперед, с другой стороны, отсутствие лишних
		// срабатываний для пользователя, хотя бы раз в неделю заходящего в базу.
		МинимальныйГоризонтАктуальностиЗадач = ТекущаяДатаСеанса() + УпреждениеЗаполнения / 2 * 86400;
		
		ДатаАктуальности = РегистрыСведений.АктуальностьСпискаЗадачБухгалтера.ДатаАктуальности(Организация);
		Если МинимальныйГоризонтАктуальностиЗадач <= КонецМесяца(ДатаАктуальности) Тогда
			// Перезаполнение списка задач не требуется
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	ПараметрыЗаполнения.Вставить("Упреждение",  УпреждениеЗаполнения);
	ПараметрыЗаполнения.Вставить("ОбновитьИЗаполнитьЗадачиНачалаРаботы", Ложь);
	ПараметрыЗаполнения.Вставить("ОбновитьИЗаполнитьРегулярныеЗадачи",   Истина);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	
	ЗаполнитьВФоне(ПараметрыЗаполнения, АдресХранилища);
	
КонецПроцедуры

// При работе в режиме сервиса добавляем в очередь выполнение регламентного задания ОбновлениеЗадачБухгалтера.
// Вызов данной процедуры выполняется из мест, непосредственно использующих функциональность списка задач бухгалтера.
// Таким образом периодическое выполнение обновлений списка задач происходит только для активных областей.
//
Процедура ЗапланироватьОбновлениеЗадачБухгалтера() Экспорт

	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено()
	 Или Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МетаданныеРегламентногоЗадания = Метаданные.РегламентныеЗадания.ОбновлениеЗадачБухгалтера;
	ПланируемыйМоментЗапуска = (КонецДня(ТекущаяДатаСеанса()) + 1) + (ВремяНачалаОбновленияЗадачБухгалтера() - '00010101');

	ПараметрыПоискаЗадания = Новый Структура;
	ПараметрыПоискаЗадания.Вставить("ИмяМетода", 	 МетаданныеРегламентногоЗадания.ИмяМетода);
	ПараметрыПоискаЗадания.Вставить("ОбластьДанных", ОбщегоНазначения.ЗначениеРазделителяСеанса());
	ПараметрыПоискаЗадания.Вставить("Использование", Истина);
	
	// Получаем ранее запланированные выполнения задания.
	ЗапланированныеВыполнения = ОчередьЗаданий.ПолучитьЗадания(ПараметрыПоискаЗадания);
	
	// Проверяем, есть ли запланированные на требуемую ночь (или ранее).
	УжеЗапланированоВыполнение = Ложь;
	Для каждого ЗапланированноеВыполнение Из ЗапланированныеВыполнения Цикл
	
		ОтклонениеОтПлана = ЗапланированноеВыполнение.ЗапланированныйМоментЗапуска - ПланируемыйМоментЗапуска;
		Если ОтклонениеОтПлана < 8 * 60 * 60 Тогда
			УжеЗапланированоВыполнение = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	// Создаём новый момент запуска.
	Если Не УжеЗапланированоВыполнение Тогда
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ИмяМетода", 	                              ПараметрыПоискаЗадания.ИмяМетода);
		ПараметрыЗадания.Вставить("ОбластьДанных",                            ПараметрыПоискаЗадания.ОбластьДанных);
		ПараметрыЗадания.Вставить("ЗапланированныйМоментЗапуска", 	          ПланируемыйМоментЗапуска);
		ПараметрыЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 	  МетаданныеРегламентногоЗадания.ИнтервалПовтораПриАварийномЗавершении);
		ПараметрыЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", МетаданныеРегламентногоЗадания.КоличествоПовторовПриАварийномЗавершении);
		ОчередьЗаданий.ДобавитьЗадание(ПараметрыЗадания);

	КонецЕсли;
		
КонецПроцедуры

// При работе в режиме сервиса отключает предопределенное регламентное задание ОбновлениеЗадачБухгалтера.
//
Процедура ОтключитьОбновлениеЗадачБухгалтераВСервисе() Экспорт
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено()
	 Или Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий") Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеЗадач = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОбновлениеЗадачБухгалтера);
	Если ОбновлениеЗадач = Неопределено Или Не ОбновлениеЗадач.Использование Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеЗадач.Использование = Ложь;
	Попытка
		ОбновлениеЗадач.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации("ПриВключенииРазделенияПоОбластямДанных",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегламентныеЗадания.ОбновлениеЗадачБухгалтера,
			ОбновлениеЗадач.УникальныйИдентификатор,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ИнформационнаяПанель

Функция ДанныеЗадачиБухгалтера(Организация) Экспорт
	
	СтатусыВыполненныхЗадач = Новый Массив;
	СтатусыВыполненныхЗадач.Добавить("Сдано");
	
	Данные = Новый Структура();
	Данные.Вставить("КоличествоПросроченных", 0);
	Данные.Вставить("Просроченнаязадача",     НоваяПросроченнаяЗадачаИнформационнойПанели());
	Данные.Вставить("АктуальныеЗадачи",       НоваяТаблицаЗадачИнформационнойПанели());
	
	// Для увеличения производительности запросы выполняются в привилегированном режиме.
	// Выполнение проверки доступности данных по выбранной организации по RLS.
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокОрганизаций = Новый Массив;
		Если ДоступныеОрганизации.Найти(Организация) <> Неопределено Тогда
			СписокОрганизаций.Добавить(Организация);
		КонецЕсли;
	Иначе
		СписокОрганизаций = Новый Массив(ДоступныеОрганизации);
	КонецЕсли;
	
	Если СписокОрганизаций.Количество() = 0 Тогда
		Возврат Данные;
	КонецЕсли;
	
	ВерхняяГраницаСроков = Перечисления.ОтносительныеСроки.ВерхняяГраница();
	
	ТекущаяДата  = НачалоДня(ТекущаяДатаСеанса());
	КонецПериода = КонецДня(ТекущаяДата + (ВерхняяГраницаСроков * 86400));
	НаименованиеЗадачиУплатаПатента = НСтр("ru = 'уплата патента'");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущаяДата",       ТекущаяДата);
	Запрос.УстановитьПараметр("КонецПериода",      КонецПериода);
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("НаименованиеЗадачиУплатаПатента", НаименованиеЗадачиУплатаПатента);
	Запрос.УстановитьПараметр("СтатусыВыполненныхЗадач",         СтатусыВыполненныхЗадач);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Правило КАК Правило,
	|	ЗадачиБухгалтера.ПериодСобытия КАК ПериодСобытия,
	|	ЗадачиБухгалтера.Срок,
	|	ЗадачиБухгалтера.НаименованиеСокращенное КАК Наименование
	|ПОМЕСТИТЬ ВТ_АктуальныеЗадачи
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Организация В(&СписокОрганизаций)
	|	И НЕ ЗадачиБухгалтера.ВАрхиве
	|	И НЕ ЗадачиБухгалтера.Статус В (&СтатусыВыполненныхЗадач)
	|	И ЗадачиБухгалтера.Срок МЕЖДУ &ТекущаяДата И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Срок КАК Срок,
	|	Требования.Действие КАК Действие,
	|	Требования.Владелец.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ДействиеПорядок,
	|	Требования.Владелец.Ссылка КАК Задача
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ВТ_АктуальныеЗадачи.Правило = Требования.Ссылка
	|ГДЕ
	|	НЕ Требования.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Срок,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога),
	|	&НаименованиеЗадачиУплатаПатента,
	|	5,
	|	Патенты.Ссылка
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патенты КАК Патенты
	|		ПО ВТ_АктуальныеЗадачи.Правило = Патенты.Ссылка
	|ГДЕ
	|	Патенты.Владелец В(&СписокОрганизаций)
	|	И НЕ Патенты.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Срок,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.РегулярныйПлатеж),
	|	ВТ_АктуальныеЗадачи.Наименование,
	|	4,
	|	ПравилаРегулярныхПлатежей.Ссылка
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаРегулярныхПлатежей КАК ПравилаРегулярныхПлатежей
	|		ПО ВТ_АктуальныеЗадачи.Правило = ПравилаРегулярныхПлатежей.Ссылка
	|ГДЕ
	|	НЕ ПравилаРегулярныхПлатежей.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Срок,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Проверка),
	|	ПроверкиКонтролирующимиОрганами.Наименование,
	|	1,
	|	ПроверкиКонтролирующимиОрганами.Ссылка
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроверкиКонтролирующимиОрганами КАК ПроверкиКонтролирующимиОрганами
	|		ПО ВТ_АктуальныеЗадачи.Правило = ПроверкиКонтролирующимиОрганами.Ссылка
	|ГДЕ
	|	НЕ ПроверкиКонтролирующимиОрганами.ПометкаУдаления
	|ИТОГИ ПО
	|	Срок,
	|	Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Организация В(&СписокОрганизаций)
	|	И НЕ ЗадачиБухгалтера.ВАрхиве
	|	И НЕ ЗадачиБухгалтера.Статус В (&СтатусыВыполненныхЗадач)
	|	И ЗадачиБухгалтера.Срок < &ТекущаяДата
	|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Перечисление.ЗадачиНачалаРаботы
	|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Справочник.ПроверкиКонтролирующимиОрганами";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Актуальные задачи
	
	АктуальныеЗадачи = Данные.АктуальныеЗадачи;
	
	СрокиПоДням = Перечисления.ОтносительныеСроки.СрокиПоДням();
	
	ВыборкаПоСроку = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Срок");
	Пока ВыборкаПоСроку.Следующий() Цикл
		
		ОсталосьДней = ОсталосьДней(ТекущаяДата, ВыборкаПоСроку.Срок);
		
		ОтносительныйСрок = СрокиПоДням.Получить(ОсталосьДней);
		Если ОтносительныйСрок = Неопределено ИЛИ ОтносительныйСрок = Перечисления.ОтносительныеСроки.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаПоЗадаче = ВыборкаПоСроку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Задача");
		Пока ВыборкаПоЗадаче.Следующий() Цикл
			
			// Одинаковые задачи с разными действиями сворачиваем в одну строку
			Выборка = ВыборкаПоЗадаче.Выбрать();
			Если Выборка.Следующий() Тогда
				НоваяЗадача = АктуальныеЗадачи.Добавить();
				НоваяЗадача.Наименование             = Выборка.Наименование;
				НоваяЗадача.ОтносительныйСрок        = ОтносительныйСрок;
				НоваяЗадача.ОсталосьДней             = ОсталосьДней;
				НоваяЗадача.ДействиеПорядок          = Выборка.ДействиеПорядок;
				НоваяЗадача.ОтносительныйСрокПорядок = Перечисления.ОтносительныеСроки.Порядок(ОтносительныйСрок, ОсталосьДней);
				// Если действие не одно, то указываем наименование задачи
				Если Выборка.Количество() > 1 Тогда
					НоваяЗадача.Действие = Выборка.Наименование;
				Иначе
					НоваяЗадача.Действие = Выборка.Действие;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	АктуальныеЗадачи.Индексы.Добавить("ОтносительныйСрок");
	
	Данные.Вставить("АктуальныеЗадачи", АктуальныеЗадачи);
	
	// Просроченные задачи
	КоличествоПросроченых = Результат[2].Выбрать();
	Если КоличествоПросроченых.Следующий() Тогда
		Данные.КоличествоПросроченных = КоличествоПросроченых.Количество;
	КонецЕсли;
	
	// Просроченных задач может быть много, поэтому уточняем данные задачи только если она одна
	Если Данные.КоличествоПросроченных = 1 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗадачиБухгалтера.Правило КАК Правило,
		|	ЗадачиБухгалтера.Срок,
		|	ЗадачиБухгалтера.НаименованиеСокращенное КАК Наименование
		|ПОМЕСТИТЬ ВТ_ПросроченныеЗадачи
		|ИЗ
		|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
		|ГДЕ
		|	ЗадачиБухгалтера.Организация В(&СписокОрганизаций)
		|	И НЕ ЗадачиБухгалтера.ВАрхиве
		|	И НЕ ЗадачиБухгалтера.Статус В (&СтатусыВыполненныхЗадач)
		|	И ЗадачиБухгалтера.Срок < &ТекущаяДата
		|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Перечисление.ЗадачиНачалаРаботы
		|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Справочник.ПроверкиКонтролирующимиОрганами
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Правило
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АктуальныеЗадачи.Срок КАК Срок,
		|	Требования.Владелец.Наименование КАК Наименование
		|ИЗ
		|	ВТ_ПросроченныеЗадачи КАК ВТ_АктуальныеЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
		|		ПО ВТ_АктуальныеЗадачи.Правило = Требования.Ссылка
		|ГДЕ
		|	НЕ Требования.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_АктуальныеЗадачи.Срок,
		|	&НаименованиеЗадачиУплатаПатента
		|ИЗ
		|	ВТ_ПросроченныеЗадачи КАК ВТ_АктуальныеЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патенты КАК Патенты
		|		ПО ВТ_АктуальныеЗадачи.Правило = Патенты.Ссылка
		|ГДЕ
		|	Патенты.Владелец В(&СписокОрганизаций)
		|	И НЕ Патенты.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_АктуальныеЗадачи.Срок,
		|	ВТ_АктуальныеЗадачи.Наименование
		|ИЗ
		|	ВТ_ПросроченныеЗадачи КАК ВТ_АктуальныеЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаРегулярныхПлатежей КАК ПравилаРегулярныхПлатежей
		|		ПО ВТ_АктуальныеЗадачи.Правило = ПравилаРегулярныхПлатежей.Ссылка
		|ГДЕ
		|	НЕ ПравилаРегулярныхПлатежей.ПометкаУдаления";
		
		УстановитьПривилегированныйРежим(Истина);
		Результат = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Данные.ПросроченнаяЗадача, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ОсталосьДней(ТекущаяДата, Срок)
	
	Возврат (НачалоДня(Срок) - НачалоДня(ТекущаяДата))/86400;
	
КонецФункции

Функция НоваяПросроченнаяЗадачаИнформационнойПанели()
	
	ПросроченнаяЗадача = Новый Структура;
	ПросроченнаяЗадача.Вставить("Наименование", "");
	ПросроченнаяЗадача.Вставить("Срок", Дата(1, 1, 1));
	
	Возврат ПросроченнаяЗадача;
	
КонецФункции

Функция НоваяТаблицаЗадачИнформационнойПанели()
	
	ТипыДействия = Новый Массив();
	ТипыДействия.Добавить(Тип("Строка"));
	ТипыДействия.Добавить(Тип("ПеречислениеСсылка.ВидыДействийКалендаряБухгалтера"));
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Наименование",             ОбщегоНазначения.ОписаниеТипаСтрока(100));
	НоваяТаблица.Колонки.Добавить("Действие",                 Новый ОписаниеТипов(ТипыДействия, , Новый КвалификаторыСтроки(50)));
	НоваяТаблица.Колонки.Добавить("ОтносительныйСрок",        Новый ОписаниеТипов("ПеречислениеСсылка.ОтносительныеСроки"));
	НоваяТаблица.Колонки.Добавить("ОсталосьДней",             ОбщегоНазначения.ОписаниеТипаЧисло(2, 0));
	НоваяТаблица.Колонки.Добавить("ОтносительныйСрокПорядок", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0));
	НоваяТаблица.Колонки.Добавить("ДействиеПорядок",          ОбщегоНазначения.ОписаниеТипаЧисло(1, 0));
	
	Возврат НоваяТаблица;
	
КонецФункции

#КонецОбласти

#Область КалендарьGoogle

Функция СобытияКалендаряДляGoogle(Организации) Экспорт
	
	ТекущаяДата  = НачалоДня(ТекущаяДатаСеанса());
	НаименованиеЗадачиУплатаПатента = НСтр("ru = 'уплата патента'");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущаяДата",       ТекущаяДата);
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НаименованиеЗадачиУплатаПатента", НаименованиеЗадачиУплатаПатента);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Правило КАК Правило,
	|	ЗадачиБухгалтера.ПериодСобытия КАК ПериодСобытия,
	|	ЗадачиБухгалтера.ВАрхиве КАК Выполнено,
	|	ЗадачиБухгалтера.Срок,
	|	ЗадачиБухгалтера.НаименованиеСокращенное КАК Наименование,
	|	ЗадачиБухгалтера.Наименование КАК НаименованиеПолное,
	|	ЗадачиБухгалтера.Организация
	|ПОМЕСТИТЬ ВТ_АктуальныеЗадачи
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Организация В(&СписокОрганизаций)
	|	И ЗадачиБухгалтера.Срок >= &ТекущаяДата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Организация КАК Организация,
	|	ВТ_АктуальныеЗадачи.Срок КАК Срок,
	|	Требования.Владелец.Наименование КАК Наименование,
	|	ВТ_АктуальныеЗадачи.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ДействиеПорядок,
	|	Требования.Владелец.Ссылка КАК Задача,
	|	ВТ_АктуальныеЗадачи.Выполнено КАК Выполнено
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ВТ_АктуальныеЗадачи.Правило = Требования.Ссылка
	|ГДЕ
	|	НЕ Требования.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Организация,
	|	ВТ_АктуальныеЗадачи.Срок,
	|	&НаименованиеЗадачиУплатаПатента,
	|	ВТ_АктуальныеЗадачи.НаименованиеПолное,
	|	5,
	|	Патенты.Ссылка,
	|	ВТ_АктуальныеЗадачи.Выполнено
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патенты КАК Патенты
	|		ПО ВТ_АктуальныеЗадачи.Правило = Патенты.Ссылка
	|ГДЕ
	|	Патенты.Владелец В(&СписокОрганизаций)
	|	И НЕ Патенты.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Организация,
	|	ВТ_АктуальныеЗадачи.Срок,
	|	ВТ_АктуальныеЗадачи.Наименование,
	|	ВТ_АктуальныеЗадачи.НаименованиеПолное,
	|	4,
	|	ПравилаРегулярныхПлатежей.Ссылка,
	|	ВТ_АктуальныеЗадачи.Выполнено
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаРегулярныхПлатежей КАК ПравилаРегулярныхПлатежей
	|		ПО ВТ_АктуальныеЗадачи.Правило = ПравилаРегулярныхПлатежей.Ссылка
	|ГДЕ
	|	НЕ ПравилаРегулярныхПлатежей.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Организация,
	|	ВТ_АктуальныеЗадачи.Срок,
	|	ПроверкиКонтролирующимиОрганами.Наименование,
	|	ВТ_АктуальныеЗадачи.НаименованиеПолное,
	|	1,
	|	ПроверкиКонтролирующимиОрганами.Ссылка,
	|	ВТ_АктуальныеЗадачи.Выполнено
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроверкиКонтролирующимиОрганами КАК ПроверкиКонтролирующимиОрганами
	|		ПО ВТ_АктуальныеЗадачи.Правило = ПроверкиКонтролирующимиОрганами.Ссылка
	|ГДЕ
	|	НЕ ПроверкиКонтролирующимиОрганами.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Срок,
	|	Наименование,
	|	ДействиеПорядок
	|ИТОГИ
	|	МИНИМУМ(ДействиеПорядок),
	|	МИНИМУМ(Выполнено)
	|ПО
	|	Организация,
	|	Срок,
	|	Наименование";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗадачиОрганизаций = Новый Соответствие();
	
	ВыборкаПоОрганизации = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока ВыборкаПоОрганизации.Следующий() Цикл
		
		СписокЗадачи = НовыйСписокЗадачДляКалендаряGoogle();
		
		ВыборкаПоСроку = ВыборкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Срок");
		Пока ВыборкаПоСроку.Следующий() Цикл
			
			ВыборкаПоЗадаче = ВыборкаПоСроку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Наименование");
			Пока ВыборкаПоЗадаче.Следующий() Цикл
				
				Задача = СписокЗадачи.Добавить();
				НаименованиеЗадачи = ВРЕГ(Лев(ВыборкаПоЗадаче.Наименование, 1)) + СРЕД(ВыборкаПоЗадаче.Наименование, 2);
				Задача.Наименование = НаименованиеЗадачи;
				Задача.ДатаЗадачи   = ВыборкаПоЗадаче.Срок;
				Задача.Выполнено    = ВыборкаПоЗадаче.Выполнено;
				Задача.Порядок      = ВыборкаПоЗадаче.ДействиеПорядок;
				
				Подзадачи = Новый Массив;
				
				Выборка  = ВыборкаПоЗадаче.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Если Выборка.Количество() > 1 Тогда
					
					МассивОписаний = Новый Массив;
					НомерПодзадачи = 0;
					Пока Выборка.Следующий() Цикл
						НомерПодзадачи = НомерПодзадачи + 1;
						ОписаниеЗадачи = СтрШаблон("%1. %2", НомерПодзадачи, Выборка.НаименованиеПолное);
						МассивОписаний.Добавить(ОписаниеЗадачи);
					КонецЦикла;
					
					Задача.Описание = СтрСоединить(МассивОписаний, Символы.ПС);
					
				ИначеЕсли Выборка.Следующий() Тогда
					Задача.Описание = Выборка.НаименованиеПолное;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗадачиОрганизаций.Вставить(ВыборкаПоОрганизации.Организация, СписокЗадачи);
		
	КонецЦикла;
	
	Возврат ЗадачиОрганизаций;
	
КонецФункции

Функция НовыйСписокЗадачДляКалендаряGoogle()
	
	СписокЗадачи = Новый ТаблицаЗначений();
	СписокЗадачи.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	СписокЗадачи.Колонки.Добавить("ДатаЗадачи",   Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	СписокЗадачи.Колонки.Добавить("Порядок",      Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0)));
	СписокЗадачи.Колонки.Добавить("Выполнено",    Новый ОписаниеТипов("Булево"));
	СписокЗадачи.Колонки.Добавить("Описание",     Новый ОписаниеТипов("Строка"));
	Возврат СписокЗадачи;
	
КонецФункции

#КонецОбласти
